In [1]:
#importing the libraries
library(tidyr)
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.2.1 ──
✔ ggplot2 3.0.0     ✔ purrr   0.2.5
✔ tibble  1.4.2     ✔ dplyr   0.7.6
✔ readr   1.1.1     ✔ stringr 1.3.1
✔ ggplot2 3.0.0     ✔ forcats 0.3.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [2]:
#reading the file into a csv
employee.data <- read.csv("/Users/manoharsaijasti/employee-data.csv", skip = 23, stringsAsFactors = FALSE)
employee.data <- as.tibble(employee.data)

In [3]:
head(employee.data)

  emp_no first_name last_name birth_date gender title           salary
1 10001  Georgi     Facello   02/09/1953 M      Senior Engineer 60117
2 10002  Bezalel    Simmel    02/06/1964 F      Staff           65828
3 10003  Parto      Bamford   03/12/1959 M      Senior Engineer 40006
4 10004  Chirstian  Koblick   01/05/1954 M      Engineer        40054
5 10005  Kyoichi    Maliniak  21/01/1955 M      Senior Staff    78228
6 10006  Anneke     Preusig   20/04/1953 F      Senior Engineer 40000
  latest_start_date end_of_contract_date
1 22/06/2010        01/01/9999
2 02/08/2001        01/01/9999
3 01/12/2001        01/01/9999
4 27/11/2001        01/01/9999
5 09/09/2001        01/01/9999
6 02/08/2001        01/01/9999

In [4]:
#Checking if the data has any missing values.
any(is.na(employee.data))

[1] FALSE

In [5]:
#Arranging the dataset by gender, then last name, and made first_name, last_name, and gender the first three variables in the data frame
employee.a <- employee.data %>% 
  select(ends_with("name"), gender, everything()) %>%
  #Filtering only the employees whose salary is higher than 70,000.
  filter(salary >= 70000) %>% 
  arrange(gender, last_name)

In [6]:
head(employee.a)

  first_name last_name gender emp_no birth_date title        salary
1 Aleksandar Ananiadou F      10175  11/01/1960 Staff        72285
2 Hironoby   Atchley   F      10924  27/04/1954 Senior Staff 84783
3 Marko      Auria     F      10232  11/03/1956 Senior Staff 89606
4 Dung       Baca      F      10107  13/06/1956 Senior Staff 93159
5 Susumu     Bade      F      10236  26/03/1960 Staff        80469
6 Mara       Bahi      F      10921  20/07/1955 Engineer     72601
  latest_start_date end_of_contract_date
1 23/09/1994        24/05/1995
2 11/08/2001        01/01/9999
3 02/06/2002        01/01/9999
4 29/03/2002        01/01/9999
5 29/08/2001        01/01/9999
6 23/07/2002        01/01/9999

In [7]:
#Creating a data frame containing only the employee numbers of those earning more than 70,000.
good.earners <- employee.a["emp_no"]

In [8]:
#Finding out how much each position (title) earns on average by gender
employee.b <- employee.data %>% 
  group_by(title, gender) %>% 
  summarise(avg.salary = mean(salary)) %>% 
  mutate(monthly = avg.salary/12) %>% 
  arrange(gender, desc(monthly))

In [ ]:
employee.